sql11/MSAS11.MSSQLSERVER/OLAP/bin/flightrecordertracedef.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
	<Body>
		<Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
			<Command>
				<Batch xmlns="http://schemas.microsoft.com/analysisservices/2003/engine">
					<Create>
						<ObjectDefinition>
							<Trace>
								<ID>FlightRecorder</ID>
								<Name>FlightRecorder</Name>
								<LogFileSize>10</LogFileSize>
									<Events>
										<Event>
											<EventID>1</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>23</ColumnID> 
												<ColumnID>35</ColumnID> 
												<ColumnID>43</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>33</ColumnID> 
												<ColumnID>37</ColumnID> 
												<ColumnID>0</ColumnID> 
												<ColumnID>32</ColumnID> 
												<ColumnID>36</ColumnID> 
												<ColumnID>40</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>2</EventID> 
											<Columns>
												<ColumnID>23</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>5</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>33</ColumnID> 
												<ColumnID>37</ColumnID> 
												<ColumnID>4</ColumnID> 
												<ColumnID>32</ColumnID> 
												<ColumnID>36</ColumnID> 
												<ColumnID>40</ColumnID> 
												<ColumnID>35</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>4</EventID> 
											<Columns>
												<ColumnID>1</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>9</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>44</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>43</ColumnID> 
												<ColumnID>45</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>10</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>23</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>6</ColumnID> 
												<ColumnID>22</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>5</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>43</ColumnID> 
												<ColumnID>4</ColumnID> 
												<ColumnID>24</ColumnID> 
												<ColumnID>28</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>11</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>4</ColumnID> 
												<ColumnID>6</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>5</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>15</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>8</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>44</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>43</ColumnID> 
												<ColumnID>45</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>16</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>23</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>6</ColumnID> 
												<ColumnID>22</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>5</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>4</ColumnID> 
												<ColumnID>8</ColumnID> 
												<ColumnID>24</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>17</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>8</ColumnID> 
												<ColumnID>22</ColumnID> 
												<ColumnID>23</ColumnID> 
												<ColumnID>24</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>32</ColumnID> 
												<ColumnID>33</ColumnID> 
												<ColumnID>35</ColumnID> 
												<ColumnID>36</ColumnID> 
												<ColumnID>37</ColumnID> 
												<ColumnID>39</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>33</EventID> 
											<Columns>
												<ColumnID>1</ColumnID> 
												<ColumnID>3</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>45</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>34</EventID> 
											<Columns>
												<ColumnID>1</ColumnID> 
												<ColumnID>3</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>35</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>4</ColumnID> 
												<ColumnID>6</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>5</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>36</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>43</ColumnID> 
												<ColumnID>45</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>38</EventID> 
											<Columns>
												<ColumnID>3</ColumnID> 
												<ColumnID>23</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>6</ColumnID> 
												<ColumnID>22</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>5</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>4</ColumnID> 
												<ColumnID>24</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>39</EventID> 
											<Columns>
												<ColumnID>15</ColumnID> 
												<ColumnID>2</ColumnID> 
												<ColumnID>10</ColumnID> 
												<ColumnID>14</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>1</ColumnID> 
												<ColumnID>5</ColumnID> 
												<ColumnID>13</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>45</ColumnID> 
												<ColumnID>4</ColumnID> 
												<ColumnID>12</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>3</ColumnID> 
												<ColumnID>11</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
										<Event>
											<EventID>17</EventID> 
											<Columns>
												<ColumnID>0</ColumnID> 
												<ColumnID>3</ColumnID> 
												<ColumnID>8</ColumnID> 
												<ColumnID>22</ColumnID> 
												<ColumnID>23</ColumnID> 
												<ColumnID>24</ColumnID> 
												<ColumnID>25</ColumnID> 
												<ColumnID>28</ColumnID> 
												<ColumnID>32</ColumnID> 
												<ColumnID>33</ColumnID> 
												<ColumnID>35</ColumnID> 
												<ColumnID>36</ColumnID> 
												<ColumnID>37</ColumnID> 
												<ColumnID>39</ColumnID> 
												<ColumnID>41</ColumnID> 
												<ColumnID>42</ColumnID> 
												<ColumnID>43</ColumnID> 
											</Columns>
										</Event>
									</Events>
							</Trace>
						</ObjectDefinition>
					</Create>
				</Batch>
			</Command>
			<Properties/>
		</Execute>
	</Body>
</Envelope>
