testsrc/main/mondrian/xmla/error/Execute02.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <Foo>Have a nice day</Foo>
  </Header>
  <Body>
    <Execute xmlns="urn:schemas-microsoft-com:xml-analysis">
      <Command>
        <Statement/>
      </Command>
      <FooProperties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
        </PropertyList>
      </FooProperties>
    </Execute>
  </Body>
</Envelope>
